In [16]:
import pandas as pd

In [21]:
df = pd.read_csv("sales_data.csv")

In [22]:
duplicates = df.duplicated()

In [24]:
duplicates

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [25]:
duplicates.sum()

2

In [26]:
oracle_engine = create_engine('''oracle+cx_oracle://system:admin@localhost:1521/xe''')

NameError: name 'create_engine' is not defined

In [27]:
import pandas as pd
import pytest
# for connection string
from sqlalchemy import create_engine
# for connecting oracle
import cx_Oracle

In [28]:
oracle_engine = create_engine('''oracle+cx_oracle://system:admin@localhost:1521/xe''')

In [29]:
mysql_engine = create_engine('''mysql+pymysql://root:Admin%40143@localhost:3308/etlautomation''')

In [40]:
query_oracle_src = '''select * from city'''
query_mysql_tgt = '''select * from city'''

In [41]:
df_oracle = pd.read_sql(query_oracle_src,oracle_engine)
df_mysql = pd.read_sql(query_mysql_tgt, mysql_engine)

In [42]:
df_oracle

    id       name
0    1      Delhi
1    2  Bangalore
2   11     Bhopal
3  100    Kolkata
4    3       Pune
5    4     Mumbai
6    8        Goa
7    9     Kanpur
8   10       Agra

In [43]:
df_mysql

    id       name
0    1      Delhi
1    2  Bangalore
2    3       Pune
3    4     Mumbai
4    8        Goa
5    9     Kanpur
6  100    Kolkata
7  101     Indore

In [44]:
df_mysql['id'].isin(df_oracle['id'])

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7    False
Name: id, dtype: bool

In [46]:
~df_mysql['id'].isin(df_oracle['id'])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: id, dtype: bool

In [47]:
df_mysql[~df_mysql['id'].isin(df_oracle['id'])]

    id    name
7  101  Indore

In [48]:
query_oracle_src = '''select count(*) from city'''
query_mysql_tgt = '''select count(*) from city'''

In [50]:
df_oracle = pd.read_sql(query_oracle_src,connect_to_oracle_source)
df_mysql = pd.read_sql(query_mysql_tgt, connect_to_mysql_target)

NameError: name 'connect_to_oracle_source' is not defined

In [51]:
df_oracle = pd.read_sql(query_oracle_src,oracle_engine)
df_mysql = pd.read_sql(query_mysql_tgt, mysql_engine)

In [52]:
df_oracle

   COUNT(*)
0         9

In [53]:
df_mysql

   count(*)
0         8

In [54]:
df_oracle

   COUNT(*)
0         9

In [55]:
df_oracle.iloc[0,0]

9

In [56]:
df_mysql.iloc[0,0]

8